kokoory/mm-iot-esp32/esp32p4_heli_fc/sdkconfig.defaults.esp32p4
#
# ESP32-P4 specific configuration for Helicopter Flight Controller
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-P4 has dual-core RISC-V, enable both cores
CONFIG_FREERTOS_NUMBER_OF_CORES=2

# SPI RAM (if available on board)
CONFIG_SPIRAM=n

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
